---
kind: type
id: T:Autodesk.Revit.DB.OrdinateDimensionLineStyle
source: html/6051744a-13fa-3a9d-d23b-07b2d29f87f4.htm
---
# Autodesk.Revit.DB.OrdinateDimensionLineStyle

The ordinate dimension line style.

## Syntax (C#)
```csharp
public enum OrdinateDimensionLineStyle
```